optimagyf/RFIDscanner/nodeMCULolinV3_ESP8266/src/main.cpp
// void testfillroundrect(void)
// {
//   display.clearDisplay();

//   for (int16_t i = 0; i < display.height() / 2 - 2; i += 2)
//   {
//     // The INVERSE color is used so round-rects alternate white/black
//     display.fillRoundRect(i, i, display.width() - 2 * i, display.height() - 2 * i,
//                           display.height() / 4, SSD1306_INVERSE);
//     display.display();
//     delay(1);
//   }

//   delay(2000);
// }

// void testdrawtriangle(void)
// {
//   display.clearDisplay();

//   for (int16_t i = 0; i < max(display.width(), display.height()) / 2; i += 5)
//   {
//     display.drawTriangle(
//         display.width() / 2, display.height() / 2 - i,
//         display.width() / 2 - i, display.height() / 2 + i,
//         display.width() / 2 + i, display.height() / 2 + i, SSD1306_WHITE);
//     display.display();
//     delay(1);
//   }

//   delay(2000);
// }

// void testfilltriangle(void)
// {
//   display.clearDisplay();

//   for (int16_t i = max(display.width(), display.height()) / 2; i > 0; i -= 5)
//   {
//     // The INVERSE color is used so triangles alternate white/black
//     display.fillTriangle(
//         display.width() / 2, display.height() / 2 - i,
//         display.width() / 2 - i, display.height() / 2 + i,
//         display.width() / 2 + i, display.height() / 2 + i, SSD1306_INVERSE);
//     display.display();
//     delay(1);
//   }

//   delay(2000);
// }

// void testdrawchar(void)
// {
//   display.clearDisplay();

//   display.setTextSize(1);              // Normal 1:1 pixel scale
//   display.setTextColor(SSD1306_WHITE); // Draw white text
//   display.setCursor(0, 0);             // Start at top-left corner
//   display.cp437(true);                 // Use full 256 char 'Code Page 437' font

//   // Not all the characters will fit on the display. This is normal.
//   // Library will draw what it can and the rest will be clipped.
//   for (int16_t i = 0; i < 256; i++)
//   {
//     if (i == '\n')
//       display.write(' ');
//     else
//       display.write(i);
//   }

//   display.display();
//   delay(20000);
// }

// void testdrawstyles(void)
// {
//   display.clearDisplay();

//   display.setTextSize(1);              // Normal 1:1 pixel scale
//   display.setTextColor(SSD1306_WHITE); // Draw white text
//   display.setCursor(0, 0);             // Start at top-left corner
//   display.println(F("Hello, world!"));

//   display.setTextColor(SSD1306_BLACK, SSD1306_WHITE); // Draw 'inverse' text
//   display.println(3.141592);

//   display.setTextSize(2); // Draw 2X-scale text
//   display.setTextColor(SSD1306_WHITE);
//   display.print(F("0x"));
//   display.println(0xDEADBEEF, HEX);

//   display.display();
//   delay(20000);
// }

// void testscrolltext(void)
// {
//   display.clearDisplay();

//   display.setTextSize(2); // Draw 2X-scale text
//   display.setTextColor(SSD1306_WHITE);
//   display.setCursor(10, 0);
//   display.println(F("scroll"));
//   display.display(); // Show initial text
//   delay(100);

//   // Scroll in various directions, pausing in-between:
//   display.startscrollright(0x00, 0x0F);
//   delay(2000);
//   display.stopscroll();
//   delay(1000);
//   display.startscrollleft(0x00, 0x0F);
//   delay(2000);
//   display.stopscroll();
//   delay(1000);
//   display.startscrolldiagright(0x00, 0x07);
//   delay(2000);
//   display.startscrolldiagleft(0x00, 0x07);
//   delay(2000);
//   display.stopscroll();
//   delay(10000);
// }

// void testdrawbitmap(void)
// {
//   display.clearDisplay();

//   display.drawBitmap(
//       (display.width() - LOGO_WIDTH) / 2,
//       (display.height() - LOGO_HEIGHT) / 2,
//       logo_bmp, LOGO_WIDTH, LOGO_HEIGHT, 1);
//   display.display();
//   delay(10000);
// }

// #define XPOS 0 // Indexes into the 'icons' array in function below
// #define YPOS 1
// #define DELTAY 2

// void testanimate(const uint8_t *bitmap, uint8_t w, uint8_t h)
// {
//   int8_t f, icons[NUMFLAKES][3];

//   // Initialize 'snowflake' positions
//   for (f = 0; f < NUMFLAKES; f++)
//   {
//     icons[f][XPOS] = random(1 - LOGO_WIDTH, display.width());
//     icons[f][YPOS] = -LOGO_HEIGHT;
//     icons[f][DELTAY] = random(1, 6);
//     Serial.print(F("x: "));
//     Serial.print(icons[f][XPOS], DEC);
//     Serial.print(F(" y: "));
//     Serial.print(icons[f][YPOS], DEC);
//     Serial.print(F(" dy: "));
//     Serial.println(icons[f][DELTAY], DEC);
//   }

//   for (;;)
//   {                         // Loop forever...
//     display.clearDisplay(); // Clear the display buffer

//     // Draw each snowflake:
//     for (f = 0; f < NUMFLAKES; f++)
//     {
//       display.drawBitmap(icons[f][XPOS], icons[f][YPOS], bitmap, w, h, SSD1306_WHITE);
//     }

//     display.display(); // Show the display buffer on the screen
//     delay(200);        // Pause for 1/10 second

//     // Then update coordinates of each flake...
//     for (f = 0; f < NUMFLAKES; f++)
//     {
//       icons[f][YPOS] += icons[f][DELTAY];
//       // If snowflake is off the bottom of the screen...
//       if (icons[f][YPOS] >= display.height())
//       {
//         // Reinitialize to a random position, just off the top
//         icons[f][XPOS] = random(1 - LOGO_WIDTH, display.width());
//         icons[f][YPOS] = -LOGO_HEIGHT;
//         icons[f][DELTAY] = random(1, 6);
//       }
//     }
//   }
// }

// void setup()
// {
//   Serial.begin(9600);

//   // SSD1306_SWITCHCAPVCC = generate display voltage from 3.3V internally
//   if (!display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS))
//   {
//     Serial.println(F("SSD1306 allocation failed"));
//     for (;;)
//       ; // Don't proceed, loop forever
//   }

//   // Show initial display buffer contents on the screen --
//   // the library initializes this with an Adafruit splash screen.
//   display.display();
//   delay(20000); // Pause for 2 seconds

//   // Clear the buffer
//   display.clearDisplay();

//   // // Draw a single pixel in white
//   // display.drawPixel(10, 10, SSD1306_WHITE);

//   // // Show the display buffer on the screen. You MUST call display() after
//   // // drawing commands to make them visible on screen!
//   // display.display();
//   // delay(2000);
//   // // display.display() is NOT necessary after every single drawing command,
//   // // unless that's what you want...rather, you can batch up a bunch of
//   // // drawing operations and then update the screen all at once by calling
//   // // display.display(). These examples demonstrate both approaches...

//   // testdrawline(); // Draw many lines

