optimagyf/RFIDscanner/nodeMCULolinV3_ESP8266/src/main.cpp
bool triggerPortalConfiguration = false;

void ICACHE_RAM_ATTR handleInterrupt()
{
  triggerPortalConfiguration = true;
}

void setup()
{
  // put your setup code here, to run once:
  // initialize the LED digital pin as an output.
  pinMode(PIN_LED, OUTPUT);
  pinMode(PIN_D1, INPUT_PULLUP);

  Serial.begin(115200);
  while (!Serial)
    ;

  delay(200);

  Serial.println("");
  Serial.println("");
  Serial.println(" *** ");
  Serial.println("Begin setup");
  Serial.println(" *** ");

  // *** Initialisation of the screen
  if (!display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS))
  {
    Serial.println(F("SSD1306 allocation failed"));
    for (;;)
      ;
  }

  // Show initial display buffer contents on the screen --
  // the library initializes this with an Adafruit splash screen.
  display.display();

  // *** Initialisation of RFID reader
  // Init SPI bus
  SPI.begin();
  // Init MFRC522
  mfrc522.PCD_Init();
  // Optional delay. Some board do need more time after init to be ready, see Readme
  delay(4);
  // Show details of PCD - MFRC522 Card Reader details
  mfrc522.PCD_DumpVersionToSerial();
  // Serial.println(F("Scan PICC to see UID, SAK, type, and data blocks..."));

  // *** Initialisation of wifi connexion
  setupWifi();

  // *** Setup interaction button
  attachInterrupt(digitalPinToInterrupt(PIN_D1), handleInterrupt, FALLING);

  display.clearDisplay();
  display.display();
  Serial.println(" *** ");
  Serial.println("End setup");
  Serial.println(" *** ");
}

String getUID(MFRC522::Uid *uid)
{
  String res = "";

  for (byte i = 0; i < uid->size; i++)
  {
    res += String(uid->uidByte[i], HEX);
  }
  return res;
}

const String SERVER_IP("192.168.8.100:3000");

void doGetnSendUID()
{
  WiFiClient client;
  HTTPClient http;

  Serial.print("[HTTP] begin...\n");
  // configure traged server and url
  String serverEndPoint = "http://" + SERVER_IP + "/postplain/";
  Serial.print("[HTTP] serverEndPoint: " + serverEndPoint + "\n");
  http.setReuse(true);
  http.begin(client, serverEndPoint);
  http.addHeader("Content-Type", "application/json");

  // start connection and send HTTP header and body
  String message = "{\"uid\":" + getUID(&(mfrc522.uid)) + "}";
  Serial.print("[HTTP] message: " + message + "\n");
  int httpCode = http.POST(message);
  String payload = http.getString();
  Serial.print("[HTTP] payload: " + payload + "\n");

  // httpCode will be negative on error
  if (httpCode > 0)
  {
    // HTTP header has been send and Server response header has been handled
    Serial.printf("[HTTP] POST succeeded\n");
  }
  else
  {
    Serial.printf("[POST FAILED] httpCode: %d\n", httpCode);
    Serial.printf("[POST FAILED] error: %s\n", http.errorToString(httpCode).c_str());
  }

  http.end();
}

void getnSendUID()
{
  static ulong checkgetuid_timeout = 0;

  static ulong current_millis;

#define GETUID_INTERVAL 1000L

  current_millis = millis();

  // Reset the loop if no new card present on the sensor/reader.
  // This saves the entire process when idle.
  if (!mfrc522.PICC_IsNewCardPresent())
  {
    return;
  }

  // Select one of the cards
  if (!mfrc522.PICC_ReadCardSerial())
  {
    return;
  }

  // Check RFID every GETUID_INTERVAL (1) seconds.
  if ((current_millis > checkgetuid_timeout) || (checkgetuid_timeout == 0))
  {
    doGetnSendUID();
    checkgetuid_timeout = current_millis + GETUID_INTERVAL;
  }
}

void loop()
{
  // is configuration portal requested?
  if (triggerPortalConfiguration)
  {
    triggerPortalConfiguration = false;
    requestPortalConfiguration();
  }

  // put your main code here, to run repeatedly
  checkWifiStatus();

  if (WiFi.status() == WL_CONNECTED)
  {
    getnSendUID();
  }
}